<script setup lang="ts">
import Logo from '@/components/Logo.vue';
import MenuItem from '@/components/Menu/navItems/MenuItem.vue'
import DrpItem from '@/components/Menu/navItems/DrpItem.vue'
import DrpBox from '@/components/Menu/navItems/DrpBox.vue'
import NavBar from '@/components/Menu/NavBar/NavBar.vue';
import NavItem from '@/components/Menu/NavBar/NavItem.vue';
import { onMounted, ref } from 'vue';
import { RouterLink, useRoute } from 'vue-router';
import SearchBar from '@/components/Menu/search/SearchBar.vue';
import ProfileUser from '@/components/Menu/profile/ProfileUser.vue';
import { useUser } from '@/stores/Authentication/useUser';
import Loading from '@/components/Loading.vue';
import HttpRequest, { BaseUrl } from '@/Api/ApiConfig';
import MenuMobile from '@/components/Menu/MenuXS/MenuMobile.vue';
import { useToken } from '@/stores/Authentication/useToken';

let router = useRoute()
let userStore = useUser()
let tokenStore = useToken()

let drpActivelide = ref(1)

let isActive = ref(false)

let isMenuMobileOpen = ref(false)

let MenuAnimation = () => {
    if (document.documentElement.scrollTop > 10) {
        isActive.value = true
    }
    else {
        isActive.value = false
    }
}

let MenuContent = ref({
    movies: 0,
    series: 0,
    tags: {
        movies: [],
        series: [],
    },
    genres: []
});
let isLoading = ref(true);


onMounted(() => {
    window.addEventListener("scroll", MenuAnimation)

    HttpRequest.get('/menu')
        .then(res => {
            isLoading.value = false
            if (res != undefined) {
                MenuContent.value = res?.data
            }
        })
        .catch(err => isLoading.value = false)
})

</script>

<template>
    <nav :class="{
        'MenuContainer': true,
        'active': isActive
    }">
        <div class="MenuSection">
            <div class="menuBerger" @click="isMenuMobileOpen = true">
                <div class="line"></div>
                <div class="line"></div>
                <div class="line"></div>
            </div>
            <div class="rightMenu">
                <Logo />
                <div class="MenuContent">
                    <div class="MenuDrpItem">
                        <svg class="category_icon">
                            <use xlink:href="#category">
                                <symbol viewBox="0 0 24 25" id="category">
                                    <path
                                        d="M7.24 2.5H5.34C3.15 2.5 2 3.65 2 5.83V7.73C2 9.91 3.15 11.06 5.33 11.06H7.23C9.41 11.06 10.56 9.91 10.56 7.73V5.83C10.57 3.65 9.42 2.5 7.24 2.5Z">
                                    </path>
                                    <path opacity="0.4"
                                        d="M18.6704 2.5H16.7704C14.5904 2.5 13.4404 3.65 13.4404 5.83V7.73C13.4404 9.91 14.5904 11.06 16.7704 11.06H18.6704C20.8504 11.06 22.0004 9.91 22.0004 7.73V5.83C22.0004 3.65 20.8504 2.5 18.6704 2.5Z">
                                    </path>
                                    <path
                                        d="M18.6704 13.93H16.7704C14.5904 13.93 13.4404 15.08 13.4404 17.26V19.16C13.4404 21.34 14.5904 22.49 16.7704 22.49H18.6704C20.8504 22.49 22.0004 21.34 22.0004 19.16V17.26C22.0004 15.08 20.8504 13.93 18.6704 13.93Z">
                                    </path>
                                    <path opacity="0.4"
                                        d="M7.24 13.93H5.34C3.15 13.93 2 15.08 2 17.26V19.16C2 21.35 3.15 22.5 5.33 22.5H7.23C9.41 22.5 10.56 21.35 10.56 19.17V17.27C10.57 15.08 9.42 13.93 7.24 13.93Z">
                                    </path>
                                </symbol>
                            </use>
                        </svg>
                        <p class="text" v-if="!isLoading">دسته بندی ها</p>
                        <Loading v-if="isLoading" />
                        <svg class="icon down_icon" v-if="!isLoading">
                            <use xlink:href="#down_icon">
                                <symbol viewBox="0 0 21 21" id="down_icon">
                                    <path
                                        d="M10.0973 11.4767L13.6331 7.94082C13.9585 7.61543 14.4861 7.61543 14.8114 7.94082C15.1368 8.26621 15.1368 8.79377 14.8114 9.11915L10.8853 13.0453C10.4501 13.4805 9.74446 13.4805 9.30923 13.0453L5.38311 9.11915C5.05772 8.79377 5.05772 8.26621 5.38311 7.94082C5.7085 7.61543 6.23606 7.61543 6.56145 7.94082L10.0973 11.4767Z">
                                    </path>
                                </symbol>
                            </use>
                        </svg>
                        <div class="dropDown" v-if="!isLoading">
                            <div class="rightSection">
                                <DrpItem title="بخش ها" v-model="drpActivelide" :id="1">
                                    <svg class="icon document_icon">
                                        <use xlink:href="#document">
                                            <symbol viewBox="0 0 512 512" id="document">
                                                <path
                                                    d=" M 197.33 27.34 C 236.22 27.13 275.12 27.31 314.01 27.25 C 337.17 27.26 360.57 28.08 383.20 33.48 C 401.04 37.68 418.46 44.71 433.19 55.76 C 450.75 68.87 463.69 87.58 471.15 108.08 C 480.59 133.92 482.88 161.71 483.00 189.02 C 483.00 219.66 483.00 250.30 483.00 280.94 C 482.92 304.35 483.65 327.87 480.36 351.12 C 477.59 371.71 471.94 392.22 461.34 410.22 C 453.07 424.46 441.34 436.61 427.62 445.68 C 415.88 453.40 402.77 458.92 389.22 462.54 C 365.42 469.05 340.58 470.40 316.02 470.25 C 288.35 470.25 260.68 470.25 233.02 470.25 C 206.48 470.13 179.75 471.18 153.46 466.79 C 129.52 462.91 105.62 454.75 86.61 439.29 C 72.98 428.22 62.32 413.71 55.21 397.70 C 42.94 369.90 40.23 339.04 39.99 308.98 C 40.01 275.66 40.00 242.34 40.00 209.02 C 39.86 181.88 39.81 154.42 46.02 127.83 C 50.43 108.89 57.95 90.37 70.08 75.02 C 84.92 56.12 106.30 43.05 129.21 36.34 C 151.25 29.66 174.40 27.63 197.33 27.34 M 175.64 64.84 C 159.09 66.33 142.40 69.21 127.17 76.07 C 112.23 82.68 99.25 94.00 91.71 108.60 C 79.33 131.95 77.10 158.95 76.52 184.91 C 76.47 226.28 76.52 267.66 76.49 309.03 C 76.68 327.60 77.78 346.33 82.35 364.41 C 86.52 381.27 94.48 397.70 107.75 409.26 C 119.59 419.63 134.71 425.43 149.88 428.89 C 173.20 434.19 197.25 433.83 221.02 433.75 C 252.99 433.75 284.97 433.75 316.95 433.75 C 339.82 433.86 363.07 432.62 385.02 425.67 C 400.05 420.94 414.19 412.48 424.07 400.04 C 434.07 387.37 439.45 371.71 442.53 356.04 C 447.49 331.01 446.36 305.39 446.50 280.03 C 446.50 248.70 446.48 217.39 446.51 186.07 C 446.09 163.12 444.34 139.67 435.80 118.13 C 429.33 101.56 417.30 86.89 401.30 78.78 C 377.65 66.39 350.35 64.30 324.13 63.77 C 295.11 63.72 266.10 63.77 237.08 63.75 C 216.59 63.90 196.08 63.21 175.64 64.84 Z">
                                                </path>
                                                <path
                                                    d=" M 184.56 169.56 C 235.62 169.43 286.68 169.51 337.74 169.52 C 348.35 169.27 357.55 179.65 355.81 190.16 C 354.90 198.88 346.86 206.27 338.02 206.01 C 286.64 205.98 235.26 206.03 183.87 205.98 C 173.81 205.67 165.70 195.55 167.17 185.67 C 167.97 176.98 175.85 169.75 184.56 169.56 Z">
                                                </path>
                                                <path
                                                    d=" M 183.57 291.56 C 235.30 291.43 287.04 291.52 338.78 291.51 C 349.07 291.74 357.48 302.01 355.81 312.14 C 354.89 320.89 346.83 328.03 338.05 327.99 C 287.36 328.02 236.66 327.98 185.96 328.01 C 179.73 328.23 173.42 325.11 170.03 319.83 C 166.53 314.54 166.03 307.42 168.86 301.72 C 171.52 296.05 177.34 292.08 183.57 291.56 Z">
                                                </path>
                                            </symbol>
                                        </use>
                                    </svg>
                                </DrpItem>
                                <DrpItem title="لیست ها" v-model="drpActivelide" :id="2">
                                    <svg class="icon more_square_icon">
                                        <use xlink:href="#more_square">
                                            <symbol viewBox="0 0 512 512" id="more_square">
                                                <path
                                                    d=" M 175.68 40.80 C 189.08 39.68 202.53 40.05 215.96 40.00 C 243.63 40.00 271.30 40.00 298.97 40.00 C 318.48 40.10 338.06 39.38 357.47 41.76 C 383.80 44.70 410.56 51.86 432.03 68.02 C 450.01 81.40 462.69 101.03 469.61 122.19 C 478.25 147.80 480.27 175.13 480.00 201.99 C 480.00 230.99 480.00 259.98 480.00 288.98 C 479.84 313.03 480.92 337.21 477.40 361.09 C 474.48 381.62 468.88 402.14 458.04 419.99 C 449.00 435.12 435.94 447.79 420.58 456.45 C 400.03 468.18 376.45 473.41 353.08 475.64 C 335.11 477.48 317.02 476.92 298.99 477.00 C 267.65 477.00 236.31 477.00 204.97 477.00 C 180.03 477.20 154.78 475.44 130.74 468.36 C 107.29 461.61 85.15 448.34 70.62 428.42 C 53.26 405.01 46.48 375.63 44.07 347.05 C 42.61 331.42 43.07 315.71 43.00 300.03 C 43.00 267.01 43.00 233.99 43.00 200.97 C 42.81 170.89 45.44 140.04 57.24 112.06 C 62.89 98.74 70.94 86.35 81.35 76.26 C 92.54 65.39 106.25 57.33 120.82 51.90 C 138.38 45.34 157.04 42.23 175.68 40.80 M 172.59 71.84 C 159.71 73.03 146.85 75.23 134.59 79.43 C 116.84 85.31 100.66 96.84 91.04 113.09 C 77.57 135.54 74.72 162.37 73.78 188.01 C 73.69 234.02 73.79 280.04 73.74 326.05 C 74.34 350.29 76.71 375.29 87.46 397.39 C 95.14 413.29 108.50 426.21 124.59 433.47 C 147.50 443.92 173.15 446.01 198.03 446.25 C 231.68 446.25 265.32 446.25 298.97 446.25 C 318.34 446.15 337.79 446.87 357.05 444.39 C 376.43 441.98 396.21 437.04 412.21 425.37 C 426.02 415.52 435.55 400.62 440.80 384.65 C 448.07 362.59 449.44 339.09 449.25 316.02 C 449.25 281.67 449.25 247.32 449.25 212.97 C 449.50 186.14 449.43 158.68 441.01 132.89 C 435.27 114.87 423.88 98.28 407.51 88.38 C 385.31 74.82 358.66 71.79 333.17 70.77 C 286.11 70.71 239.05 70.78 191.99 70.74 C 185.51 70.94 179.04 71.24 172.59 71.84 Z">
                                                </path>
                                                <path
                                                    d=" M 174.51 238.81 C 181.57 236.67 189.69 238.81 194.79 244.13 C 199.74 248.99 201.81 256.54 200.11 263.25 C 198.50 270.69 192.25 276.87 184.80 278.42 C 179.05 279.77 172.74 278.46 167.99 274.95 C 162.45 270.90 159.28 263.92 159.79 257.09 C 160.25 248.70 166.44 241.07 174.51 238.81 Z">
                                                </path>
                                                <path
                                                    d=" M 256.39 238.65 C 266.16 235.88 277.22 241.68 280.64 251.20 C 283.82 259.23 281.20 269.08 274.41 274.44 C 269.30 278.57 262.10 280.01 255.80 278.12 C 247.77 276.02 241.70 268.46 241.10 260.23 C 240.08 250.56 246.96 240.92 256.39 238.65 Z">
                                                </path>
                                                <path
                                                    d=" M 337.39 238.72 C 348.17 235.42 360.48 242.91 362.71 253.89 C 365.18 263.56 359.37 274.50 349.88 277.68 C 342.74 280.35 334.12 278.70 328.65 273.32 C 323.41 268.49 321.14 260.69 322.88 253.78 C 324.42 246.59 330.31 240.62 337.39 238.72 Z">
                                                </path>
                                            </symbol>
                                        </use>
                                    </svg>
                                </DrpItem>
                                <DrpItem title="همه ژانر ها" v-model="drpActivelide" :id="3">
                                    <svg class="icon video_icon">
                                        <use xlink:href="#video">
                                            <symbol viewBox="0 0 512 512" id="video">
                                                <path
                                                    d=" M 89.76 86.60 C 107.39 80.04 126.41 78.94 145.04 78.74 C 178.69 78.76 212.34 78.74 245.99 78.75 C 263.51 78.86 281.10 78.22 298.55 80.20 C 314.78 82.09 331.22 86.60 344.58 96.36 C 355.94 104.77 364.23 116.91 368.93 130.17 C 373.25 142.66 375.01 155.87 375.78 169.02 C 384.84 162.60 393.97 156.27 403.05 149.86 C 412.75 142.97 424.01 137.66 436.03 136.91 C 450.18 135.60 464.83 142.38 472.84 154.15 C 480.18 164.52 482.81 177.45 482.99 189.97 C 483.02 240.97 482.98 291.98 483.01 342.98 C 483.12 356.04 481.12 369.70 473.75 380.78 C 466.96 391.68 454.63 398.73 441.85 399.45 C 428.74 400.06 415.96 395.11 405.29 387.78 C 395.43 380.94 385.64 374.01 375.81 367.14 C 374.66 386.86 371.19 407.33 359.91 424.00 C 350.10 438.36 334.53 448.14 317.82 452.44 C 294.76 458.76 270.65 457.34 247.01 457.50 C 212.67 457.51 178.34 457.49 144.01 457.51 C 124.05 457.64 103.72 453.70 86.25 443.76 C 68.49 433.84 55.02 417.16 47.85 398.24 C 41.16 381.37 39.65 363.00 40.00 345.01 C 39.99 291.34 40.01 237.67 39.99 184.01 C 40.21 161.72 41.71 138.42 52.50 118.40 C 60.29 103.53 74.15 92.41 89.76 86.60 M 139.25 115.35 C 133.71 115.54 128.15 115.72 122.64 116.40 C 112.35 117.72 101.56 119.68 93.07 126.07 C 87.15 130.19 83.68 136.85 81.38 143.51 C 77.36 155.57 76.88 168.41 76.50 181.00 C 76.50 237.00 76.50 292.99 76.50 348.98 C 76.42 357.31 76.88 365.68 78.63 373.84 C 81.35 387.09 87.90 399.92 98.81 408.23 C 111.56 418.18 128.26 420.86 144.03 421.01 C 181.01 420.99 217.98 421.01 254.96 421.00 C 270.40 420.92 285.97 421.60 301.23 418.75 C 312.12 416.86 323.60 412.55 329.95 402.95 C 337.62 390.48 338.81 375.40 339.48 361.12 C 339.53 299.40 339.48 237.69 339.50 175.97 C 339.06 164.20 338.09 152.21 333.94 141.09 C 330.91 132.89 324.81 125.65 316.65 122.22 C 302.97 116.09 287.68 115.66 272.94 115.24 C 228.38 115.33 183.81 115.12 139.25 115.35 M 417.92 184.14 C 403.95 193.91 390.03 203.77 376.02 213.49 C 375.99 249.87 375.98 286.24 376.02 322.62 C 393.04 334.43 409.90 346.46 426.95 358.23 C 431.35 360.86 436.42 363.79 441.72 362.58 C 445.76 358.14 446.18 351.80 446.49 346.10 C 446.52 294.40 446.49 242.69 446.50 190.99 C 446.36 186.30 445.99 181.47 444.05 177.13 C 443.10 175.10 441.29 173.04 438.83 173.26 C 430.73 174.15 424.39 179.73 417.92 184.14 Z">
                                                </path>
                                                <path
                                                    d=" M 244.22 169.12 C 257.18 167.31 270.85 170.62 281.17 178.76 C 292.85 187.74 300.16 202.22 300.03 217.00 C 300.31 229.41 295.36 241.77 286.86 250.77 C 277.72 260.53 264.39 266.36 250.99 266.03 C 238.17 266.13 225.42 260.73 216.54 251.49 C 206.81 241.79 201.70 227.76 202.72 214.08 C 203.47 200.99 209.89 188.38 219.96 180.01 C 226.82 174.21 235.33 170.42 244.22 169.12 M 247.54 205.76 C 243.04 207.26 239.60 211.50 239.16 216.24 C 238.38 222.93 244.18 229.47 250.91 229.53 C 257.67 229.97 263.90 223.78 263.53 217.02 C 263.57 209.21 254.92 203.04 247.54 205.76 Z">
                                                </path>
                                            </symbol>
                                        </use>
                                    </svg>
                                </DrpItem>
                            </div>
                            <div class="leftSection">
                                <div :class="{
                                    'drpSlides': true,
                                    'active': drpActivelide == 1
                                }">
                                    <DrpBox title="فیلم ها" :count="MenuContent?.movies" :border="true"
                                        :path="{ name: 'all-movies', query: { category: 0 } }" />
                                    <DrpBox title="سریال ها" :count="MenuContent?.series" :border="true"
                                        :path="{ name: 'all-movies', query: { category: 1 } }" />
                                    <DrpBox title="خرید اشتراک" :count="-1" text="به زودی" :border="true" />
                                    <DrpBox title="پخش آنلاین" :count="-1" text="به زودی" :border="true" />
                                    <DrpBox title=" باکس آفیس" :count="-1" text="به زودی" :border="true" />
                                    <DrpBox title="پیشنهاد فیلم" :count="-1" text="به زودی" :border="true" />
                                </div>
                                <div :class="{
                                    'drpSlides': true,
                                    'active': drpActivelide == 2
                                }">
                                    <div class="BoxList">
                                        <p class="title">فیلم:</p>
                                        <div class="itemsList">
                                            <RouterLink class="item" v-for="tag in MenuContent?.tags?.movies"
                                                :key="tag.id" :to="{ name: 'all-movies', query: { tag: tag.id } }">{{
                                                    tag.title }}</RouterLink>
                                        </div>
                                    </div>
                                    <div class="BoxList">
                                        <p class="title">سریال:</p>
                                        <div class="itemsList">
                                            <RouterLink class="item" v-for="tag in MenuContent?.tags?.series"
                                                :key="tag.id" :to="{ name: 'all-movies', query: { tag: tag.id } }">{{
                                                    tag.title }}</RouterLink>
                                        </div>

                                    </div>
                                </div>
                                <div :class="{
                                    'drpSlides': true,
                                    'active': drpActivelide == 3
                                }">
                                    <DrpBox :title="genre.title" :count="Number(genre.count)"
                                        v-for="genre in MenuContent?.genres" :key="genre.id"
                                        :path="{ name: 'all-movies', query: { genres: genre.id } }" />
                                </div>
                            </div>
                        </div>
                    </div>
                    <MenuItem title="هنرمندان" />
                    <MenuItem title="پخش آنلاین" />
                    <MenuItem title="خرید اشتراک" />
                </div>
            </div>
            <div class="leftMenu">
                <SearchBar />

                <Loading v-if="userStore.userLoading || userStore.logoutLoading" />
                <RouterLink v-if="!userStore.userLoading && !userStore.logoutLoading && !userStore.user"
                    :to="{ name: 'auth.login' }" class="authenticationButton">
                    <svg viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g stroke-width="2" fill="none" fill-rule="evenodd" stroke-linecap="round"
                            stroke-linejoin="round">
                            <g stroke-width="2">
                                <path
                                    d="M7.8766,13.2062 C4.0326,13.2062 0.7496,13.7872 0.7496,16.1152 C0.7496,18.4432 4.0126,19.0452 7.8766,19.0452 C11.7216,19.0452 15.0036,18.4632 15.0036,16.1362 C15.0036,13.8092 11.7416,13.2062 7.8766,13.2062 Z"
                                    id="Stroke-1"></path>
                                <path
                                    d="M7.8766,9.8859 C10.3996,9.8859 12.4446,7.8409 12.4446,5.3179 C12.4446,2.7949 10.3996,0.7499 7.8766,0.7499 C5.3546,0.7499 3.30957019,2.7949 3.30957019,5.3179 C3.3006,7.8319 5.3306,9.8769 7.8456,9.8859 L7.8766,9.8859 Z"
                                    id="Stroke-3"></path>
                                <line x1="17.2037" y1="6.6691" x2="17.2037" y2="10.6791" id="Stroke-5"></line>
                                <line x1="19.2496" y1="8.674" x2="15.1596" y2="8.674" id="Stroke-7"></line>
                            </g>
                        </g>
                    </svg>
                    ورود و عضویت
                </RouterLink>
                <ProfileUser v-if="!userStore.userLoading && !userStore.logoutLoading && userStore.user"
                    :data="userStore.user" />
            </div>
        </div>
    </nav>

    <MenuMobile v-model:isActive="isMenuMobileOpen" :isLoading="isLoading" :MenuContent="MenuContent" />

    <NavBar>
        <NavItem title="خانه" :isActive="router.name == 'home'" :path="{name: 'home'}">
            <svg class="icon home_mobile_icon">
                <use xlink:href="#home">
                    <symbol viewBox="0 0 100 100" id="home">
                        <path
                            d=" M 46.22 5.34 C 51.36 4.89 56.73 6.06 60.90 9.19 C 68.93 14.85 76.99 20.47 85.04 26.10 C 91.21 30.20 95.06 37.63 94.77 45.04 C 94.71 55.03 94.79 65.02 94.73 75.00 C 94.65 85.36 85.42 94.52 75.10 94.72 C 58.40 94.77 41.70 94.76 25.00 94.72 C 14.64 94.58 5.39 85.40 5.27 75.02 C 5.21 64.69 5.29 54.35 5.23 44.02 C 5.07 37.09 8.55 30.26 14.06 26.11 C 21.23 20.61 28.31 15.00 35.45 9.47 C 38.52 7.03 42.34 5.71 46.22 5.34 M 42.48 12.64 C 39.89 13.79 37.78 15.73 35.56 17.43 C 29.71 22.00 23.85 26.56 17.99 31.11 C 14.04 34.11 11.40 38.99 11.49 43.99 C 11.52 54.00 11.49 64.00 11.50 74.01 C 11.30 81.73 18.28 88.66 25.98 88.50 C 40.99 88.52 55.99 88.47 71.00 88.52 C 79.62 89.91 88.77 83.06 88.51 74.05 C 88.51 64.36 88.47 54.67 88.53 44.98 C 88.67 39.45 85.63 33.93 80.97 30.97 C 72.89 25.38 64.86 19.71 56.81 14.08 C 52.70 11.16 47.10 10.79 42.48 12.64 Z">
                        </path>
                        <path
                            d=" M 48.11 59.85 C 49.99 58.51 53.04 59.64 53.09 62.08 C 53.36 66.68 53.43 71.34 53.03 75.94 C 52.31 78.67 47.83 78.85 47.10 76.06 C 46.92 71.07 46.91 66.06 47.10 61.07 C 47.35 60.76 47.85 60.15 48.11 59.85 Z">
                        </path>
                    </symbol>
                </use>
            </svg>
        </NavItem>
        <NavItem title="منو" :isActive="false" @clickEvent="isMenuMobileOpen = true">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M21.0004 6.6738C21.0004 8.7024 19.3552 10.3476 17.3266 10.3476C15.298 10.3476 13.6537 8.7024 13.6537 6.6738C13.6537 4.6452 15.298 3 17.3266 3C19.3552 3 21.0004 4.6452 21.0004 6.6738Z"
                    stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M10.3467 6.6738C10.3467 8.7024 8.7024 10.3476 6.6729 10.3476C4.6452 10.3476 3 8.7024 3 6.6738C3 4.6452 4.6452 3 6.6729 3C8.7024 3 10.3467 4.6452 10.3467 6.6738Z"
                    stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M21.0004 17.2619C21.0004 19.2905 19.3552 20.9348 17.3266 20.9348C15.298 20.9348 13.6537 19.2905 13.6537 17.2619C13.6537 15.2333 15.298 13.5881 17.3266 13.5881C19.3552 13.5881 21.0004 15.2333 21.0004 17.2619Z"
                    stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M10.3467 17.2619C10.3467 19.2905 8.7024 20.9348 6.6729 20.9348C4.6452 20.9348 3 19.2905 3 17.2619C3 15.2333 4.6452 13.5881 6.6729 13.5881C8.7024 13.5881 10.3467 15.2333 10.3467 17.2619Z"
                    stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
            </svg>
        </NavItem>
        <NavItem title="فیلم ها" :isActive="router.name == 'all-movies'" :path="{name: 'all-movies'}">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M16.1515 9.67278C17.9896 8.21564 20.4563 6.80611 20.9229 7.31087C21.6943 8.13945 21.6277 16.0252 20.9229 16.7775C20.4943 17.2442 18.0086 15.8347 16.1515 14.3871"
                    stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
                <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M2.5144 12.037C2.5144 6.84461 4.23917 5.11414 9.41536 5.11414C14.5906 5.11414 16.3154 6.84461 16.3154 12.037C16.3154 17.2284 14.5906 18.9599 9.41536 18.9599C4.23917 18.9599 2.5144 17.2284 2.5144 12.037Z"
                    stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
            </svg>
        </NavItem>
        <NavItem title="پروفایل" :isActive="false" :path="{name: 'auth.login'}" v-if="!tokenStore.token">
            <svg width="24px" height="24px" viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink">
                <g id="Iconly/Light-Outline/Profile" stroke="none" stroke-width="1.5" fill="none" fill-rule="evenodd">
                    <g id="Profile" transform="translate(4.000000, 2.000000)">
                        <path
                            d="M15.8399,16.1931 C15.8399,19.4891 11.3199,19.8701 7.9209,19.8701 L7.67766371,19.8698897 C5.51210414,19.8646311 -0.0001,19.7279077 -0.0001,16.1731 C-0.0001,12.9443653 4.33825235,12.5128651 7.71138402,12.4965976 L8.16412764,12.4963103 C10.329545,12.5015689 15.8399,12.6382923 15.8399,16.1931 Z M7.9209,13.9961 C3.6599,13.9961 1.4999,14.7281 1.4999,16.1731 C1.4999,17.6311 3.6599,18.3701 7.9209,18.3701 C12.1809,18.3701 14.3399,17.6381 14.3399,16.1931 C14.3399,14.7351 12.1809,13.9961 7.9209,13.9961 Z M7.9209,-0.0003 C10.8489,-0.0003 13.2299,2.3817 13.2299,5.3097 C13.2299,8.2377 10.8489,10.6187 7.9209,10.6187 L7.8889,10.6187 C4.9669,10.6097 2.5999,8.2267 2.60986843,5.3067 C2.60986843,2.3817 4.9919,-0.0003 7.9209,-0.0003 Z M7.9209,1.4277 C5.7799,1.4277 4.03787882,3.1687 4.03787882,5.3097 C4.0309,7.4437 5.7599,9.1837 7.8919,9.1917 L7.9209,9.9057 L7.9209,9.1917 C10.0609,9.1917 11.8019,7.4497 11.8019,5.3097 C11.8019,3.1687 10.0609,1.4277 7.9209,1.4277 Z"
                            id="Combined-Shape"></path>
                    </g>
                </g>
            </svg>
        </NavItem>
        <NavItem :title="userStore.user?.username" :isActive="false"  v-if="tokenStore.token" @clickEvent="userStore.logOut()">
            <img :src="BaseUrl + userStore.user?.profile" alt="">
        </NavItem>
    </NavBar>
</template>

<style scoped>
@import '@/assets/css/components/Menu/Menu.css';
</style>