<script setup lang="ts">
import MenuItem from '@/components/Menu/navItems/MenuItem.vue';

let scrolltoTop = () => window.scrollTo({ top: 0, behavior: 'smooth' })

</script>

<template>
    <footer class="footer">
        <div class="footerSection">
            <div class="right">
                <svg class="icon backtotop_icon" @click="scrolltoTop">
                    <use xlink:href="#backtotop">
                        <symbol viewBox="0 0 104 104" id="backtotop">
                            <path
                                d=" M 36.29 8.31 C 47.21 8.20 58.13 8.24 69.05 8.29 C 77.64 8.60 87.14 11.10 92.29 18.54 C 98.04 26.81 97.74 37.36 97.75 46.99 C 97.56 56.63 98.33 66.34 96.82 75.90 C 95.65 82.96 91.96 89.95 85.51 93.48 C 76.55 98.50 65.91 97.65 56.02 97.75 C 46.94 97.56 37.76 98.37 28.79 96.60 C 22.40 95.33 16.21 91.83 12.78 86.16 C 9.32 80.41 8.28 73.57 8.24 66.96 C 8.26 57.29 8.25 47.61 8.25 37.94 C 8.42 30.31 10.00 22.18 15.30 16.36 C 20.66 10.64 28.73 8.70 36.29 8.31 M 29.48 15.58 C 25.20 16.58 20.95 18.78 18.51 22.56 C 15.50 27.07 14.72 32.65 14.51 37.95 C 14.50 47.96 14.49 57.97 14.51 67.98 C 14.77 74.60 16.03 82.07 21.42 86.54 C 26.91 90.91 34.28 91.28 41.00 91.50 C 49.31 91.49 57.63 91.53 65.95 91.48 C 72.77 91.22 80.37 90.54 85.55 85.55 C 90.50 80.40 91.21 72.85 91.45 66.07 C 91.56 57.71 91.48 49.36 91.49 41.01 C 91.24 34.30 90.91 26.91 86.51 21.44 C 82.06 16.06 74.62 14.78 68.02 14.52 C 58.66 14.46 49.31 14.53 39.96 14.49 C 36.44 14.45 32.91 14.81 29.48 15.58 Z">
                            </path>
                            <path
                                d=" M 50.49 42.38 C 51.73 40.77 54.23 40.85 55.49 42.39 C 60.34 47.24 65.27 52.02 70.01 56.98 C 72.45 59.35 68.99 63.63 66.14 61.82 C 61.57 57.73 57.43 53.14 53.00 48.88 C 48.76 53.00 44.72 57.33 40.40 61.36 C 37.94 63.84 33.72 60.53 35.46 57.54 C 40.34 52.37 45.50 47.45 50.49 42.38 Z">
                            </path>
                        </symbol>
                    </use>
                </svg>
                <div class="footerContent">
                    <MenuItem title="خرید اشتراک" />
                    <MenuItem title="پخش آنلاین" />
                    <MenuItem title="سوالات متداول" />
                    <MenuItem title="قوانین" />
                    <MenuItem title="تماس با ما" />
                </div>
            </div>
            <div class="downloadapp">دانلود اپلیکیشن</div>
        </div>
    </footer>
</template>

<style scoped>
@import '@/assets/css/components/Footer/Footer.css';
</style>